---
kind: property
id: P:Autodesk.Revit.DB.City.WeatherStation
source: html/77db36a1-bf91-e922-1d9d-81929c886944.htm
---
# Autodesk.Revit.DB.City.WeatherStation Property

An identifier for the nearest weather station

## Syntax (C#)
```csharp
public string WeatherStation { get; }
```

## Remarks
A read only string property that contains an identifier of the nearest weather station.